52n-ses-webapp/src/main/muse-webcontent/WEB-INF/examples/SubscribeAll.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header>
        <wsa:To>${ses_host}</wsa:To>
        <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest</wsa:Action>
        <wsa:MessageID>uuid:4e595160-185a-9b3c-3eb6-592c7c5b0c7a</wsa:MessageID>
        <wsa:From>
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
	<wsnt:Subscribe>
	<wsnt:ConsumerReference>
		<wsa:Address>http://localhost:8080/ses-main-3.0-SNAPSHOT2/services/SesPortType</wsa:Address>
	</wsnt:ConsumerReference>
		<wsnt:Filter />
	</wsnt:Subscribe> 
    </soap:Body>
</soap:Envelope>